src/test/resources/payloads/payment_data.json

{
  "payoutId": "8917c345-4791-4285-a416-62f24b6982db",
  "amount": "15.21",
  "currency": "ZMW",
  "country": "ZMB",
  "correspondent": "MTN_MOMO_ZMB",
  "recipient": {
    "type": "MSISDN",
    "address": {
      "value": "256780334452"
    }
  },
  "customerTimestamp": "2020-02-21T17:32:28Z",
  "statementDescription": "Up to 22 chars note"
}